Revit 2027 API
ExportFontInfo.DestinationFontName Property
 The destination font name (the name of the font in the exported format).
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string DestinationFontName { get; set; }
Public Property DestinationFontName As String
	Get
	Set
public:
property String^ DestinationFontName {
	String^ get ();
	void set (String^ value);
}
member DestinationFontName : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
ExportFontInfo Class
Autodesk.Revit.DB Namespace